{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-CVVCARTAOCREDITO",
    "1": "B-PRIMEIRONOME",
    "2": "I-ESTADO",
    "3": "B-ENDERECOBITCOIN",
    "4": "B-NUMEROCARTAOCREDITO",
    "5": "B-MAC",
    "6": "B-SENHA",
    "7": "B-NUMEROCONTA",
    "8": "I-NUMEROCONTA",
    "9": "B-RUA",
    "10": "B-ENDERECOETHER",
    "11": "B-NUMEROTELEFONE",
    "12": "B-USERAGENT",
    "13": "O",
    "14": "B-CVVCARTAOCREDITO",
    "15": "B-EMAIL",
    "16": "I-DATANASCIMENTO",
    "17": "B-ULTIMONOME",
    "18": "I-MAC",
    "19": "I-NUMEROTELEFONE",
    "20": "I-PRIMEIRONOME",
    "21": "B-CEP",
    "22": "I-CPF",
    "23": "I-ULTIMONOME",
    "24": "I-BIC",
    "25": "I-NUMEROPREDIO",
    "26": "B-IMEI",
    "27": "B-USUARIO",
    "28": "I-CEP",
    "29": "I-RUA",
    "30": "I-USERAGENT",
    "31": "B-IPV4",
    "32": "B-IBAN",
    "33": "I-IMEI",
    "34": "B-DATANASCIMENTO",
    "35": "B-ENDERECOSECUNDARIO",
    "36": "B-NOMECONTA",
    "37": "I-NUMEROCARTAOCREDITO",
    "38": "I-PREFIXO",
    "39": "I-SENHA",
    "40": "B-NUMEROPREDIO",
    "41": "I-ENDERECOBITCOIN",
    "42": "I-ENDERECOGPSPROXIMO",
    "43": "I-PIN",
    "44": "I-CIDADE",
    "45": "B-PREFIXO",
    "46": "I-NOMEMEIO",
    "47": "B-CPF",
    "48": "I-IP",
    "49": "I-IPV6",
    "50": "B-VINVEICULO",
    "51": "I-VINVEICULO",
    "52": "I-IPV4",
    "53": "B-IPV6",
    "54": "B-ESTADO",
    "55": "B-ENDERECOLITECOIN",
    "56": "B-VRMVEICULO",
    "57": "I-IBAN",
    "58": "I-VRMVEICULO",
    "59": "B-PIN",
    "60": "B-BIC",
    "61": "I-ENDERECOLITECOIN",
    "62": "B-CIDADE",
    "63": "I-EMAIL",
    "64": "I-ENDERECOETHER",
    "65": "I-USUARIO",
    "66": "I-NOMECONTA",
    "67": "I-ENDERECOSECUNDARIO",
    "68": "B-ENDERECOGPSPROXIMO",
    "69": "B-IP",
    "70": "B-NOMEMEIO"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BIC": 60,
    "B-CEP": 21,
    "B-CIDADE": 62,
    "B-CPF": 47,
    "B-CVVCARTAOCREDITO": 14,
    "B-DATANASCIMENTO": 34,
    "B-EMAIL": 15,
    "B-ENDERECOBITCOIN": 3,
    "B-ENDERECOETHER": 10,
    "B-ENDERECOGPSPROXIMO": 68,
    "B-ENDERECOLITECOIN": 55,
    "B-ENDERECOSECUNDARIO": 35,
    "B-ESTADO": 54,
    "B-IBAN": 32,
    "B-IMEI": 26,
    "B-IP": 69,
    "B-IPV4": 31,
    "B-IPV6": 53,
    "B-MAC": 5,
    "B-NOMECONTA": 36,
    "B-NOMEMEIO": 70,
    "B-NUMEROCARTAOCREDITO": 4,
    "B-NUMEROCONTA": 7,
    "B-NUMEROPREDIO": 40,
    "B-NUMEROTELEFONE": 11,
    "B-PIN": 59,
    "B-PREFIXO": 45,
    "B-PRIMEIRONOME": 1,
    "B-RUA": 9,
    "B-SENHA": 6,
    "B-ULTIMONOME": 17,
    "B-USERAGENT": 12,
    "B-USUARIO": 27,
    "B-VINVEICULO": 50,
    "B-VRMVEICULO": 56,
    "I-BIC": 24,
    "I-CEP": 28,
    "I-CIDADE": 44,
    "I-CPF": 22,
    "I-CVVCARTAOCREDITO": 0,
    "I-DATANASCIMENTO": 16,
    "I-EMAIL": 63,
    "I-ENDERECOBITCOIN": 41,
    "I-ENDERECOETHER": 64,
    "I-ENDERECOGPSPROXIMO": 42,
    "I-ENDERECOLITECOIN": 61,
    "I-ENDERECOSECUNDARIO": 67,
    "I-ESTADO": 2,
    "I-IBAN": 57,
    "I-IMEI": 33,
    "I-IP": 48,
    "I-IPV4": 52,
    "I-IPV6": 49,
    "I-MAC": 18,
    "I-NOMECONTA": 66,
    "I-NOMEMEIO": 46,
    "I-NUMEROCARTAOCREDITO": 37,
    "I-NUMEROCONTA": 8,
    "I-NUMEROPREDIO": 25,
    "I-NUMEROTELEFONE": 19,
    "I-PIN": 43,
    "I-PREFIXO": 38,
    "I-PRIMEIRONOME": 20,
    "I-RUA": 29,
    "I-SENHA": 39,
    "I-ULTIMONOME": 23,
    "I-USERAGENT": 30,
    "I-USUARIO": 65,
    "I-VINVEICULO": 51,
    "I-VRMVEICULO": 58,
    "O": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
